Autodesk.Revit.UI.ItemSelectionDialogResult
Since:
2017
An enumerated type listing the possible responses from a prompted dialog where the
user is asked to select one or more items.
Since:
2017

Autodesk.Revit.UI.ItemSelectionDialogResult.Canceled
The user canceled the prompted dialog.  No selected item(s) are available from
the dialog interfaces.

Autodesk.Revit.UI.ItemSelectionDialogResult.Confirmed
The user selected one or more item(s) from the prompted dialog and
confirmed the selection.  The selected item(s) are available
from the dialog interfaces.